## Q1

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("TV.csv")
df.head(2)

,Product_Name,Stars,Ratings,Reviews,current_price,MRP,channel,Operating_system,Picture_quality,Speaker,Frequency
0,Croma,4.2,1773,217,7990,20000,HD Ready 1366 x 768 Pixels,20 Speaker Output,60 Hz Refresh Rate,2 x HDMI | 2 x USB,1 Year Warranty
1,Adsun,3.8,6742,930,8699,21999,Netflix|Disney+Hotstar|Youtube,Operating System: Android Based,HD Ready 1366 x 768 Pixels,20 W Speaker Output,60 Hz Refresh Rate

In [3]:
df_1 = df[["Frequency", "Picture_quality", "Speaker"]].copy()
df_1.head(2)

            Frequency             Picture_quality              Speaker
0     1 Year Warranty          60 Hz Refresh Rate   2 x HDMI | 2 x USB
1  60 Hz Refresh Rate  HD Ready 1366 x 768 Pixels  20 W Speaker Output

In [5]:
df_1["freq1"] = df_1["Frequency"].str.contains("60 Hz") + 0
df_1["freq2"] = df_1["Picture_quality"].str.contains("60 Hz") + 0
df_1["freq3"] = df_1["Speaker"].str.contains("60 Hz") + 0
df_1.head(2)

,Frequency,Picture_quality,Speaker,freq1,freq2,freq3
0,1 Year Warranty,60 Hz Refresh Rate,2 x HDMI | 2 x USB,0,1,0
1,60 Hz Refresh Rate,HD Ready 1366 x 768 Pixels,20 W Speaker Output,1,0,0

In [6]:
df_1["freq"] = df_1["freq1"] + df_1["freq2"] + df_1["freq3"]
df_1.head(2)

,Frequency,Picture_quality,Speaker,freq1,freq2,freq3,freq
0,1 Year Warranty,60 Hz Refresh Rate,2 x HDMI | 2 x USB,0,1,0,1
1,60 Hz Refresh Rate,HD Ready 1366 x 768 Pixels,20 W Speaker Output,1,0,0,1

In [7]:
df_1["freq"].sum()

510

In [8]:
df_1.value_counts()

Frequency            Picture_quality                   Speaker                 freq1  freq2  freq3  freq
60 Hz Refresh Rate   Ultra HD (4K) 3840 x 2160 Pixels  20 W Speaker Output     1      0      0      1       90
                     HD Ready 1366 x 768 Pixels        20 W Speaker Output     1      0      0      1       49
                     Ultra HD (4K) 3840 x 2160 Pixels  24 W Speaker Output     1      0      0      1       33
                     Full HD 1920 x 1080 Pixels        20 W Speaker Output     1      0      0      1       30
                     Ultra HD (4K) 3840 x 2160 Pixels  30 W Speaker Output     1      0      0      1       30
                                                                                                            ..
                     Full HD 1366x771 Pixels           24W x 5 Speaker Output  1      0      0      1        1
                     Full HD 1366x772 Pixels           24W x 6 Speaker Output  1      0      0      1        1
                     Full HD 1366x774 Pixels           24W x 8 Speaker Output  1      0      0      1        1
                     Full HD 1366x775 Pixels           24W x 9 Speaker Output  1      0      0      1        1
Zero Dots LED Panel  60 Hz Refresh Rate                2 x HDMI | 2 x USB      0      1      0      1        1
Length: 217, dtype: int64

In [9]:
df_1.size

4662

In [11]:
df_2 = df[["Operating_system", "channel", "Picture_quality", "Stars"]].copy()
df_2.head(2)

,Operating_system,channel,Picture_quality,Stars
0,20 Speaker Output,HD Ready 1366 x 768 Pixels,60 Hz Refresh Rate,4.2
1,Operating System: Android Based,Netflix|Disney+Hotstar|Youtube,HD Ready 1366 x 768 Pixels,3.8

In [12]:
df_2["isHD"] = df_2["Operating_system"].str.contains("HD") + df_2["channel"].str.contains("HD")+ df_2["Picture_quality"].str.contains("HD") + 0
df_2["is4K"] = df_2["Operating_system"].str.contains("4K") + df_2["channel"].str.contains("4K") + df_2["Picture_quality"].str.contains("4K") + 0
df_2["is8K"] = df_2["Operating_system"].str.contains("8K") + df_2["channel"].str.contains("8K") + df_2["Picture_quality"].str.contains("8K") + 0
df_2.head(2)

,Operating_system,channel,Picture_quality,Stars,isHD,is4K,is8K
0,20 Speaker Output,HD Ready 1366 x 768 Pixels,60 Hz Refresh Rate,4.2,1,0,0
1,Operating System: Android Based,Netflix|Disney+Hotstar|Youtube,HD Ready 1366 x 768 Pixels,3.8,1,0,0

In [13]:
df_2_1 = df_2.loc[df_2["is8K"] == 1, "Stars"]
df_2_1.head(2)

442    3.6
Name: Stars, dtype: float64

In [14]:
df_2["is8K"].sum()

1

In [15]:
df_2_2 = df_2.loc[df_2["is4K"] == 1, "Stars"]

In [16]:
df_2_2.head(2)

8     4.4
10    4.4
Name: Stars, dtype: float64

In [17]:
df_2_2.mean()

3.2180821917808218

In [19]:
abs(round(3.6-df_2_2.mean(), 2))

0.38

In [20]:
df.head(2)

,Product_Name,Stars,Ratings,Reviews,current_price,MRP,channel,Operating_system,Picture_quality,Speaker,Frequency
0,Croma,4.2,1773,217,7990,20000,HD Ready 1366 x 768 Pixels,20 Speaker Output,60 Hz Refresh Rate,2 x HDMI | 2 x USB,1 Year Warranty
1,Adsun,3.8,6742,930,8699,21999,Netflix|Disney+Hotstar|Youtube,Operating System: Android Based,HD Ready 1366 x 768 Pixels,20 W Speaker Output,60 Hz Refresh Rate

In [21]:
df["reviewRate"] = df["Reviews"]/df["Ratings"]

In [23]:
df["discountRate"] = df["current_price"]/df["MRP"]

In [25]:
df["isNetflix"]=df["channel"].str.contains("Netflix")
df["isPrimeVideo"]=df["channel"].str.contains("Prime VIdeo")

In [27]:
df["highQuality"] = df["Picture_quality"].str.contains("4K|8K")

In [29]:
df.shape

(666, 16)

In [31]:
df = df.loc[~df["channel"].str.contains("Pixel|Oper"), ]

In [32]:
df.shape

(548, 16)

In [38]:
df["channel"].value_counts()

Netflix|Prime Video|Disney+Hotstar|Youtube             294
Netflix|Disney+Hotstar|Youtube                         171
Netflix|Youtube                                         28
Netflix|Prime Video|Youtube                             21
Prime Video|Disney+Hotstar|Youtube                      18
Disney+Hotstar|Youtube                                   6
Youtube                                                  4
Netflix|Prime Video|Apple TV|Disney+Hotstar|Youtube      4
Prime Video|Youtube                                      1
Prime Video                                              1
Name: channel, dtype: int64

In [40]:
df.dropna()
df.shape

(548, 16)

In [44]:
df_3 = df[["reviewRate", "MRP", "discountRate", "isNetflix", "isPrimeVideo", "highQuality", "Stars"]].copy()
df_3.head(2)

,reviewRate,MRP,discountRate,isNetflix,isPrimeVideo,highQuality,Stars
1,0.137941,21999,0.395427,True,False,False,3.8
2,0.088577,21990,0.750296,True,False,False,4.4

In [45]:
df_3.dropna()

,reviewRate,MRP,discountRate,isNetflix,isPrimeVideo,highQuality,Stars
1,0.137941,21999,0.395427,True,False,False,3.8
2,0.088577,21990,0.750296,True,False,False,4.4
3,0.090750,21999,0.749989,True,False,False,4.3
4,0.097756,24999,0.619985,True,False,False,4.3
5,0.089692,22900,0.698646,True,False,False,4.4
...,...,...,...,...,...,...,...
645,0.158607,19500,0.691795,True,False,False,4.0
647,0.177431,43990,0.840873,True,False,True,4.4
655,0.146341,27990,0.821686,True,False,False,4.4
657,0.215753,31900,0.860470,True,False,False,4.4
662,0.178666,68400,0.499766,True,False,True,4.5

In [50]:
df_3.shape

(548, 7)

In [51]:
df_3 = df_3.dropna()

In [46]:
from sklearn.ensemble import RandomForestRegressor

In [52]:
model = RandomForestRegressor(random_state=123)

In [53]:
model.fit(X = df_3.drop(columns="Stars"), y = df_3["Stars"])

RandomForestRegressor(random_state=123)

In [54]:
model.feature_importances_

array([0.31717126, 0.17487942, 0.46113958, 0.0273387 , 0.        ,
       0.01947103])

## Q2.

In [55]:
df = pd.read_csv("galaxy_users.csv")
df.head(2)

,customerID,gender,SeniorCitizen,Partner,Dependents,tenure,PhoneService,MultipleLines,InternetService,OnlineSecurity,...,DeviceProtection,TechSupport,StreamingTV,StreamingMovies,Contract,PaperlessBilling,PaymentMethod,MonthlyCharges,TotalCharges,Churn
0,7590-VHVEG,Female,0,Yes,No,1,No,No phone service,DSL,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,29.85,29.85,No
1,5575-GNVDE,Male,0,No,No,34,Yes,No,DSL,Yes,...,Yes,No,No,No,One year,No,Mailed check,56.95,1889.50,No

In [56]:
df.columns

Index(['customerID', 'gender', 'SeniorCitizen', 'Partner', 'Dependents',
       'tenure', 'PhoneService', 'MultipleLines', 'InternetService',
       'OnlineSecurity', 'OnlineBackup', 'DeviceProtection', 'TechSupport',
       'StreamingTV', 'StreamingMovies', 'Contract', 'PaperlessBilling',
       'PaymentMethod', 'MonthlyCharges', 'TotalCharges', 'Churn'],
      dtype='object')

In [57]:
df_1 = df[["OnlineSecurity", "OnlineBackup", "DeviceProtection", "TechSupport", "StreamingTV", "StreamingMovies"]].copy()
df_1.head(2)

,OnlineSecurity,OnlineBackup,DeviceProtection,TechSupport,StreamingTV,StreamingMovies
0,No,Yes,No,No,No,No
1,Yes,No,Yes,No,No,No

In [58]:
df_1["OnlineSecurity"].value_counts()

No                     3497
Yes                    2015
No internet service    1520
Name: OnlineSecurity, dtype: int64

In [73]:
df_1 = df_1.loc[(df_1["OnlineSecurity"]=="Yes") | (df_1["OnlineSecurity"]=="No"), ]
df_1 = df_1.loc[(df_1["OnlineBackup"]=="Yes") | (df_1["OnlineBackup"]=="No"), ]
df_1 = df_1.loc[(df_1["DeviceProtection"]=="Yes") | (df_1["DeviceProtection"]=="No"), ]
df_1 = df_1.loc[(df_1["StreamingMovies"]=="Yes") | (df_1["StreamingMovies"]=="No"), ]
df_1 = df_1.loc[(df_1["TechSupport"]=="Yes") | (df_1["TechSupport"]=="No"), ]
df_1 = df_1.loc[(df_1["StreamingTV"]=="Yes") | (df_1["StreamingTV"]=="No"), ]
df_1.head(2)

,OnlineSecurity,OnlineBackup,DeviceProtection,TechSupport,StreamingTV,StreamingMovies
0,No,Yes,No,No,No,No
1,Yes,No,Yes,No,No,No

In [74]:
df_1.shape

(5512, 6)

In [75]:
df_1["TechSupport"].value_counts()

No     3472
Yes    2040
Name: TechSupport, dtype: int64

In [77]:
df_1["x"] = (df_1["OnlineSecurity"].str.contains("Yes") + 0) + (df_1["OnlineBackup"].str.contains("Yes") + 0) + (df_1["DeviceProtection"].str.contains("Yes") + 0) + (df_1["TechSupport"].str.contains("Yes") + 0) + (df_1["StreamingMovies"].str.contains("Yes") + 0) + (df_1["StreamingTV"].str.contains("Yes") + 0)
df_1.head(5)

,OnlineSecurity,OnlineBackup,DeviceProtection,TechSupport,StreamingTV,StreamingMovies,x
0,No,Yes,No,No,No,No,1
1,Yes,No,Yes,No,No,No,2
2,Yes,Yes,No,No,No,No,2
3,Yes,No,Yes,Yes,No,No,3
4,No,No,No,No,No,No,0

In [78]:
df_1["x"].value_counts()

3    1117
2    1033
1     966
4     850
0     693
5     569
6     284
Name: x, dtype: int64

In [80]:
round(966 / 284, 1)

3.4

In [81]:
df_2= df.copy()

In [82]:
df_2["mm"] = df_2["TotalCharges"] //  df_2["MonthlyCharges"]
df_2["mm"].value_counts()

1.0     744
2.0     207
3.0     186
71.0    174
4.0     166
       ...
74.0     25
75.0      8
77.0      4
76.0      2
79.0      1
Name: mm, Length: 78, dtype: int64

In [83]:
df_2 = df_2[["tenure", "MonthlyCharges", "mm"]].copy()
df_2.head(2)

   tenure  MonthlyCharges    mm
0       1           29.85   1.0
1      34           56.95  33.0

In [84]:
df_2.corr()

                  tenure  MonthlyCharges        mm
tenure          1.000000        0.246862  0.998831
MonthlyCharges  0.246862        1.000000  0.246164
mm              0.998831        0.246164  1.000000

In [85]:
0.999

0.999

In [86]:
df.columns

Index(['customerID', 'gender', 'SeniorCitizen', 'Partner', 'Dependents',
       'tenure', 'PhoneService', 'MultipleLines', 'InternetService',
       'OnlineSecurity', 'OnlineBackup', 'DeviceProtection', 'TechSupport',
       'StreamingTV', 'StreamingMovies', 'Contract', 'PaperlessBilling',
       'PaymentMethod', 'MonthlyCharges', 'TotalCharges', 'Churn'],
      dtype='object')

In [87]:
df_3 = df.copy()

In [88]:
def func(x):
    if x == "Yes":
        return 1
    elif x == "No":
        return 0
    else:
        return -1

In [89]:
df_3["x1"] = df_3["SeniorCitizen"].apply(lambda x : func(x))
df_3.head(2)

,customerID,gender,SeniorCitizen,Partner,Dependents,tenure,PhoneService,MultipleLines,InternetService,OnlineSecurity,...,TechSupport,StreamingTV,StreamingMovies,Contract,PaperlessBilling,PaymentMethod,MonthlyCharges,TotalCharges,Churn,x1
0,7590-VHVEG,Female,0,Yes,No,1,No,No phone service,DSL,No,...,No,No,No,Month-to-month,Yes,Electronic check,29.85,29.85,No,-1
1,5575-GNVDE,Male,0,No,No,34,Yes,No,DSL,Yes,...,No,No,No,One year,No,Mailed check,56.95,1889.50,No,-1

In [90]:
df_3["SeniorCitizen"].value_counts()

0    5890
1    1142
Name: SeniorCitizen, dtype: int64

In [91]:
df_3 = df_3.drop(columns="x1")

In [92]:
df_3["x1"] = df_3["SeniorCitizen"]

In [93]:
df_3["x2"] = df_3["Partner"].apply(lambda x:func(x))

In [94]:
df_3["x3"] = df_3["Dependents"].apply(lambda x:func(x))

In [95]:
df_3["x4"] = df_3["tenure"]

In [96]:
df_3["x5"] = df_3["MonthlyCharges"]
df_3["x6"] = df_3["TotalCharges"]

In [97]:
df_3["x7"] = df_3["OnlineSecurity"].apply(lambda x:func(x))
df_3["x8"] = df_3["OnlineBackup"].apply(lambda x:func(x))
df_3["x9"] = df_3["DeviceProtection"].apply(lambda x:func(x))
df_3["x10"] = df_3["TechSupport"].apply(lambda x:func(x))
df_3["x11"] = df_3["StreamingMovies"].apply(lambda x:func(x))
df_3["X12"] = df_3["StreamingTV"].apply(lambda x:func(x))
df_3["y"] = df_3["Churn"]

In [99]:
df_3.head(2)

,customerID,gender,SeniorCitizen,Partner,Dependents,tenure,PhoneService,MultipleLines,InternetService,OnlineSecurity,...,x4,x5,x6,x7,x8,x9,x10,x11,X12,y
0,7590-VHVEG,Female,0,Yes,No,1,No,No phone service,DSL,No,...,1,29.85,29.85,0,1,0,0,0,0,No
1,5575-GNVDE,Male,0,No,No,34,Yes,No,DSL,Yes,...,34,56.95,1889.50,1,0,1,0,0,0,No

In [100]:
df_3_1 = df_3.loc[:,"x1":]
df_3_1.head(2)

   x1  x2  x3  x4     x5       x6  x7  x8  x9  x10  x11  X12   y
0   0   1   0   1  29.85    29.85   0   1   0    0    0    0  No
1   0   0   0  34  56.95  1889.50   1   0   1    0    0    0  No

In [107]:
df_3_1["y"] = df_3_1["y"].apply(lambda x: func(x))
df_3_1.head(2)

   x1  x2  x3  x4     x5       x6  x7  x8  x9  x10  x11  X12  y
0   0   1   0   1  29.85    29.85   0   1   0    0    0    0  0
1   0   0   0  34  56.95  1889.50   1   0   1    0    0    0  0

In [108]:
from sklearn.model_selection import train_test_split

In [109]:
df_train, df_test = train_test_split(df_3_1, train_size=0.7, random_state=123)

In [110]:
from sklearn.preprocessing import MinMaxScaler

In [111]:
model = MinMaxScaler()

In [112]:
df_train_nor = model.fit_transform(df_train)

In [113]:
model = model.fit(df_train)

In [114]:
df_test_nor = model.transform(df_test)

In [115]:
from sklearn.linear_model import LogisticRegression

In [116]:
model = LogisticRegression(random_state=123)

In [117]:
model.fit(X=df_train.drop(columns="y"), y=df_train["y"])

LogisticRegression(random_state=123)

In [118]:
pred = model.predict(df_test.drop(columns="y"))

In [119]:
from sklearn.metrics import f1_score

In [120]:
score = f1_score(y_true = df_test["y"], y_pred=pred)
score

0.548828125

In [121]:
round(score, 2)

0.55

## Q3.

In [126]:
df3 = pd.read_csv("mobiles.csv")
df3.head(2)

,screen_size,ROM,RAM,num_rear_camera,num_front_camera,battery_capacity,ratings,num_of_ratings,sales_price,discount_percent,sales
0,Very Small,64,2,1,1,1800,4.5,38645,32999,0.17,127.52
1,Small,64,4,2,1,2815,4.5,244,57149,0.04,1.39

In [127]:
df3_1 = df3.copy()

In [130]:
avg = df3_1["sales"].mean()
avg

29.75232558139535

In [129]:
kk = df3_1["sales"].var() ** (1/2)
kk

58.3995878556684

In [131]:
df3_1 = df3_1.loc[df3_1["sales"] > (avg + 2*kk), ]
df3_1.head(2)

,screen_size,ROM,RAM,num_rear_camera,num_front_camera,battery_capacity,ratings,num_of_ratings,sales_price,discount_percent,sales
98,Medium,128,6,2,1,4000,4.6,122001,18999,0.09,231.79
110,Large,128,6,4,2,4500,4.5,267028,15999,0.20,427.22

In [132]:
df3_1["perf"]= df3_1["ROM"]/32 + df3_1["RAM"]/2 + df3_1["num_front_camera"] + df3_1["num_rear_camera"]+df3_1["battery_capacity"]/1000

C:\Users\GODIMODE\AppData\Local\Temp\ipykernel_1660\3140432766.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3_1["perf"]= df3_1["ROM"]/32 + df3_1["RAM"]/2 + df3_1["num_front_camera"] + df3_1["num_rear_camera"]+df3_1["battery_capacity"]/1000

In [134]:
round(df3_1["perf"].mean(), 2)

11.01

In [135]:
df3_2 = df3.loc[df3["num_rear_camera"] != 1, ]
df3_2.head(2)

,screen_size,ROM,RAM,num_rear_camera,num_front_camera,battery_capacity,ratings,num_of_ratings,sales_price,discount_percent,sales
1,Small,64,4,2,1,2815,4.5,244,57149,0.04,1.39
4,Medium,128,4,2,1,2815,4.6,745,69149,0.02,5.15

In [136]:
df3_2 = df3_2[["sales", "battery_capacity", "ratings", "num_of_ratings", "sales_price", "discount_percent"]].copy()
df3_2.head(2)

,sales,battery_capacity,ratings,num_of_ratings,sales_price,discount_percent
1,1.39,2815,4.5,244,57149,0.04
4,5.15,2815,4.6,745,69149,0.02

In [137]:
df3_2.corr()

,sales,battery_capacity,ratings,num_of_ratings,sales_price,discount_percent
sales,1.000000,0.025680,0.226075,0.949114,-0.247760,0.223471
battery_capacity,0.025680,1.000000,-0.424129,0.034902,-0.503019,0.257373
ratings,0.226075,-0.424129,1.000000,0.191655,0.151153,-0.118578
num_of_ratings,0.949114,0.034902,0.191655,1.000000,-0.260279,0.212442
sales_price,-0.247760,-0.503019,0.151153,-0.260279,1.000000,-0.098640
discount_percent,0.223471,0.257373,-0.118578,0.212442,-0.098640,1.000000

In [138]:
round(0.949114, 2)

0.95

In [139]:
df3.columns

Index(['screen_size', 'ROM', 'RAM', 'num_rear_camera', 'num_front_camera',
       'battery_capacity', 'ratings', 'num_of_ratings', 'sales_price',
       'discount_percent', 'sales'],
      dtype='object')

In [140]:
df3.dtypes

screen_size          object
ROM                   int64
RAM                   int64
num_rear_camera       int64
num_front_camera      int64
battery_capacity      int64
ratings             float64
num_of_ratings        int64
sales_price           int64
discount_percent    float64
sales               float64
dtype: object

In [141]:
df3_3 = pd.get_dummies(df3)
df3_3.head(2)

,ROM,RAM,num_rear_camera,num_front_camera,battery_capacity,ratings,num_of_ratings,sales_price,discount_percent,sales,screen_size_Large,screen_size_Medium,screen_size_Small,screen_size_Very Large,screen_size_Very Small
0,64,2,1,1,1800,4.5,38645,32999,0.17,127.52,0,0,0,0,1
1,64,4,2,1,2815,4.5,244,57149,0.04,1.39,0,0,1,0,0

In [142]:
df3_3.shape

(430, 15)

In [144]:
from sklearn.model_selection import train_test_split

In [145]:
df3_3_train, df3_3_test = train_test_split(df3_3, train_size=0.8, random_state=123)

In [146]:
from sklearn.preprocessing import MinMaxScaler

In [147]:
model_nor = MinMaxScaler().fit(df3_3_train)

In [150]:
df3_3_train_nor = model_nor.transform(df3_3_train)
df3_3_test_nor = model_nor.transform(df3_3_test)

In [154]:
df3_3_train_nor = pd.DataFrame(df3_3_train_nor, columns=df3_3_train.columns)
df3_3_test_nor = pd.DataFrame(df3_3_test_nor, columns=df3_3_test.columns)

In [155]:
df3_3_train_nor.head(2)

,ROM,RAM,num_rear_camera,num_front_camera,battery_capacity,ratings,num_of_ratings,sales_price,discount_percent,sales,screen_size_Large,screen_size_Medium,screen_size_Small,screen_size_Very Large,screen_size_Very Small
0,0.047619,0.181818,0.333333,0.0,0.423077,0.625,0.003963,0.026073,0.093023,0.003948,0.0,0.0,1.0,0.0,0.0
1,0.238095,0.181818,0.000000,0.0,0.219615,1.000,0.011387,0.273927,0.186047,0.052148,0.0,1.0,0.0,0.0,0.0

In [151]:
aa = [3,5,7,9,11]

In [152]:
from sklearn.neighbors import KNeighborsRegressor

In [153]:
model = KNeighborsRegressor()

In [156]:
model.fit(X = df3_3_train_nor.drop(columns="sales"), y = df3_3_train_nor["sales"])

KNeighborsRegressor()

In [157]:
pred = model.predict(df3_3_test.drop(columns="sales"))

In [158]:
from sklearn.metrics import mean_squared_error

In [160]:
ans = mean_squared_error(y_true = df3_3_test["sales"], y_pred = pred)** 1/2
ans

2632.1998792274967

In [163]:
lista = []

In [192]:
for i in aa:
    m = KNeighborsRegressor(n_neighbors=i)
    m.fit(X = df3_3_train_nor.drop(columns="sales"), y = df3_3_train_nor["sales"])
    pred = m.predict(df3_3_test_nor.drop(columns="sales"))
    ans = mean_squared_error(y_true = df3_3_test_nor["sales"], y_pred = pred)** (1/2)
    lista.append(ans)

In [193]:
lista

[72.49084259603924,
 72.5561834611978,
 72.5879898636546,
 72.60390574682337,
 72.61441094901394,
 0.08186677375964535,
 0.09879109824384892,
 0.107669855645971,
 0.11232111394853059,
 0.1136902366621185]

In [166]:
3

3

In [180]:
df33 = df3.copy()

In [181]:
df33 = pd.get_dummies(df33)
df33.head(2)

,ROM,RAM,num_rear_camera,num_front_camera,battery_capacity,ratings,num_of_ratings,sales_price,discount_percent,sales,screen_size_Large,screen_size_Medium,screen_size_Small,screen_size_Very Large,screen_size_Very Small
0,64,2,1,1,1800,4.5,38645,32999,0.17,127.52,0,0,0,0,1
1,64,4,2,1,2815,4.5,244,57149,0.04,1.39,0,0,1,0,0

In [182]:
df33.shape

(430, 15)

In [183]:
df33_train, df33_test = train_test_split(df33, train_size=0.8, random_state=123)

In [184]:
model_nor = MinMaxScaler().fit(df33_train)
df33_train_nor = model_nor.transform(df33_train)
df33_test_nor = model_nor.transform(df33_test)

In [185]:
df33_train_nor = pd.DataFrame(df33_train_nor, columns=df33_train.columns)
df33_test_nor = pd.DataFrame(df33_test_nor, columns=df33_test.columns)

In [188]:
ansa = []

In [191]:
for i in aa:
    model_knn = KNeighborsRegressor(n_neighbors=i)
    model_knn.fit(X = df33_train_nor.drop(columns = "sales"), y = df33_train_nor["sales"])
    pred = model_knn.predict(df33_test_nor.drop(columns="sales"))
    ans = mean_squared_error(y_true=df33_test_nor["sales"], y_pred = pred) ** (1/2)
    ansa.append(ans)
ansa

[0.006702168645812956,
 0.00975968109222581,
 0.011592797814824233,
 0.012616032638638794,
 0.012925469912288512,
 0.08186677375964535,
 0.09879109824384892,
 0.107669855645971,
 0.11232111394853059,
 0.1136902366621185]

## Q4.

In [2]:
import pandas as pd

In [3]:
df4 = pd.read_csv("sales_pos.csv")
df4.head(2)

,user,prod,gender,age_group,job,city,marital,prod_cat1,prod_cat2,prod_cat3,purchase
0,1,P00069042,F,0-17,10,A,0,3,NaN,NaN,8370
1,1,P00248942,F,0-17,10,A,0,1,6.0,14.0,15200

In [4]:
df4.shape

(550068, 11)

In [5]:
df4["prod"].unique()

array(['P00069042', 'P00248942', 'P00087842', ..., 'P00370293',
       'P00371644', 'P00370853'], dtype=object)

In [6]:
df4["prod"].value_counts()

P00265242    1880
P00025442    1615
P00110742    1612
P00112142    1562
P00057642    1470
             ...
P00314842       1
P00298842       1
P00231642       1
P00204442       1
P00066342       1
Name: prod, Length: 3631, dtype: int64

In [7]:
df4_1 = df4.groupby("prod")["purchase"].sum().reset_index()
df4_1.head(2)

        prod  purchase
0  P00000142  12837476
1  P00000242   3967496

In [8]:
df4_1["purchase"].max()

27995166

In [9]:
df4_1.loc[df4_1["purchase"] == 27995166, ]

          prod  purchase
249  P00025442  27995166

In [10]:
df4_1_1 = df4.loc[df4["prod"] == "P00025442", ]
df4_1_1.head(2)

,user,prod,gender,age_group,job,city,marital,prod_cat1,prod_cat2,prod_cat3,purchase
667,130,P00025442,M,36-45,17,B,1,1,2.0,9.0,19706
749,142,P00025442,M,26-35,7,A,0,1,2.0,9.0,15212

In [11]:
df4_1_1["job"].value_counts()

4     221
7     187
0     179
17    143
1     124
12    117
14     84
2      78
20     75
16     60
10     55
6      54
15     50
3      46
11     38
5      31
13     24
19     20
18     14
9      12
8       3
Name: job, dtype: int64

In [12]:
4

4

In [13]:
df4.head(2)

,user,prod,gender,age_group,job,city,marital,prod_cat1,prod_cat2,prod_cat3,purchase
0,1,P00069042,F,0-17,10,A,0,3,NaN,NaN,8370
1,1,P00248942,F,0-17,10,A,0,1,6.0,14.0,15200

In [14]:
df4["age_group"].unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25'],
      dtype=object)

In [15]:
df4_2 = df4.loc[df4["age_group"] == "26-35", ]
df4_2.head(2)

,user,prod,gender,age_group,job,city,marital,prod_cat1,prod_cat2,prod_cat3,purchase
5,3,P00193542,M,26-35,15,A,0,1,2.0,NaN,15227
9,5,P00274942,M,26-35,20,A,1,8,NaN,NaN,7871

In [16]:
df4_2.isna().sum()

user              0
prod              0
gender            0
age_group         0
job               0
city              0
marital           0
prod_cat1         0
prod_cat2     69427
prod_cat3    152645
purchase          0
dtype: int64

In [17]:
df4_2.fillna(0)

,user,prod,gender,age_group,job,city,marital,prod_cat1,prod_cat2,prod_cat3,purchase
5,3,P00193542,M,26-35,15,A,0,1,2.0,0.0,15227
9,5,P00274942,M,26-35,20,A,1,8,0.0,0.0,7871
10,5,P00251242,M,26-35,20,A,1,5,11.0,0.0,5254
11,5,P00014542,M,26-35,20,A,1,8,0.0,0.0,3957
12,5,P00031342,M,26-35,20,A,1,8,0.0,0.0,6073
...,...,...,...,...,...,...,...,...,...,...,...
550058,6024,P00372445,M,26-35,12,A,1,20,0.0,0.0,121
550059,6025,P00370853,F,26-35,1,B,0,19,0.0,0.0,48
550061,6029,P00372445,F,26-35,1,C,1,20,0.0,0.0,599
550064,6035,P00375436,F,26-35,1,C,0,20,0.0,0.0,371
550065,6036,P00375436,F,26-35,15,B,1,20,0.0,0.0,137

In [18]:
df4_2 = df4_2.fillna(0)
df4_2.head(2)

,user,prod,gender,age_group,job,city,marital,prod_cat1,prod_cat2,prod_cat3,purchase
5,3,P00193542,M,26-35,15,A,0,1,2.0,0.0,15227
9,5,P00274942,M,26-35,20,A,1,8,0.0,0.0,7871

In [19]:
df4_2["prod_cat2"].unique()

array([ 2.,  0., 11.,  5., 14.,  8., 17., 13.,  6., 16., 15.,  4.,  9.,
       10., 12.,  3., 18.,  7.])

In [20]:
df4_2["prod_cat2"].dtypes

dtype('float64')

In [21]:
df4_2["prod_cat2"] = df4_2["prod_cat2"].astype('int64')
df4_2.head(2)

,user,prod,gender,age_group,job,city,marital,prod_cat1,prod_cat2,prod_cat3,purchase
5,3,P00193542,M,26-35,15,A,0,1,2,0.0,15227
9,5,P00274942,M,26-35,20,A,1,8,0,0.0,7871

In [22]:
df4_2["prod_cat3"] = df4_2["prod_cat3"].astype('int')
df4_2.head(2)

,user,prod,gender,age_group,job,city,marital,prod_cat1,prod_cat2,prod_cat3,purchase
5,3,P00193542,M,26-35,15,A,0,1,2,0,15227
9,5,P00274942,M,26-35,20,A,1,8,0,0,7871

In [23]:
df4_2["prod_cat1"] = df4_2["prod_cat1"].astype('string')
df4_2["prod_cat2"] = df4_2["prod_cat2"].astype('string')
df4_2["prod_cat3"] = df4_2["prod_cat3"].astype('string')
df4_2.head(2)

,user,prod,gender,age_group,job,city,marital,prod_cat1,prod_cat2,prod_cat3,purchase
5,3,P00193542,M,26-35,15,A,0,1,2,0,15227
9,5,P00274942,M,26-35,20,A,1,8,0,0,7871

In [24]:
df4_2["prod_cat"] = df4_2["prod_cat1"] + "-" + df4_2["prod_cat2"] + "-" + df4_2["prod_cat3"]
df4_2.head(2)

,user,prod,gender,age_group,job,city,marital,prod_cat1,prod_cat2,prod_cat3,purchase,prod_cat
5,3,P00193542,M,26-35,15,A,0,1,2,0,15227,1-2-0
9,5,P00274942,M,26-35,20,A,1,8,0,0,7871,8-0-0

In [25]:
df4_2_1 = df4_2.groupby(["user", "marital"])["prod_cat"].count().reset_index()
df4_2_1.head(2)

   user  marital  prod_cat
0     3        0        29
1     5        1       106

In [68]:
df4_2_1 = df4_2.groupby(["user", "marital"])["prod_cat"].nunique().reset_index()
df4_2_1.head(2)

   user  marital  prod_cat
0     3        0        18
1     5        1        43

In [69]:
df4_2_1.groupby(["marital"])["prod_cat"].mean().reset_index()

   marital   prod_cat
0        0  41.663183
1        1  41.792336

In [71]:
round(abs(41.663183 - 41.792336), 2)

0.13

In [28]:
df4_3 = df4.copy()
df4_3.head(2)

,user,prod,gender,age_group,job,city,marital,prod_cat1,prod_cat2,prod_cat3,purchase
0,1,P00069042,F,0-17,10,A,0,3,NaN,NaN,8370
1,1,P00248942,F,0-17,10,A,0,1,6.0,14.0,15200

In [29]:
df4_3["gender"] = df4_3["gender"].replace({"F":0, "M":1})
df4_3.head(2)

,user,prod,gender,age_group,job,city,marital,prod_cat1,prod_cat2,prod_cat3,purchase
0,1,P00069042,0,0-17,10,A,0,3,NaN,NaN,8370
1,1,P00248942,0,0-17,10,A,0,1,6.0,14.0,15200

In [30]:
df4_3["age_group"].unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25'],
      dtype=object)

In [31]:
df4_3["age_group"] = df4_3["age_group"].replace({"0-17":0, "18-25":1, "26-35":2, "36-45":3, "46-50":4, "51-55":5, "55+":6})
df4_3.head(2)

,user,prod,gender,age_group,job,city,marital,prod_cat1,prod_cat2,prod_cat3,purchase
0,1,P00069042,0,0,10,A,0,3,NaN,NaN,8370
1,1,P00248942,0,0,10,A,0,1,6.0,14.0,15200

In [36]:
df4_3_1 = df4_3.groupby(["user"])["prod"].count().reset_index()
df4_3_1.head()

   user  prod
0     1    35
1     2    77
2     3    29
3     4    14
4     5   106

In [37]:
df4_3_2 = df4_3.groupby(["user"])["purchase"].sum().reset_index()
df4_3_2.head(2)

   user  purchase
0     1    334093
1     2    810472

In [38]:
df4_3 = df4_3[["user", "gender", "age_group", "job", "city", "marital"]].copy()
df4_3.head(2)

   user  gender  age_group  job city  marital
0     1       0          0   10    A        0
1     1       0          0   10    A        0

In [42]:
df4_3 = df4_3.drop_duplicates()
df4_3.head(2)

   user  gender  age_group  job city  marital
0     1       0          0   10    A        0
4     2       1          6   16    C        0

In [43]:
df4_3_ans = pd.merge(df4_3, df4_3_1, on="user")
df4_3_ans.head(2)

   user  gender  age_group  job city  marital  prod
0     1       0          0   10    A        0    35
1     2       1          6   16    C        0    77

In [44]:
df4_3_ans = pd.merge(df4_3_ans, df4_3_2, on="user")
df4_3_ans.head(2)

   user  gender  age_group  job city  marital  prod  purchase
0     1       0          0   10    A        0    35    334093
1     2       1          6   16    C        0    77    810472

In [45]:
df4_3_ans.shape

(5891, 8)

In [46]:
df4_3_ans["city"].unique()

array(['A', 'C', 'B'], dtype=object)

In [47]:
df4_3_ans["job"].unique()

array([10, 16, 15,  7, 20,  9,  1, 12, 17,  0,  3,  4, 11,  8, 19,  2, 18,
        5, 14, 13,  6], dtype=int64)

In [51]:
df4_3_ans =pd.get_dummies(df4_3_ans, columns=["job", "city"])
df4_3_ans.head(2)

,user,gender,age_group,marital,prod,purchase,job_0,job_1,job_2,job_3,...,job_14,job_15,job_16,job_17,job_18,job_19,job_20,city_A,city_B,city_C
0,1,0,0,0,35,334093,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
1,2,1,6,0,77,810472,0,0,0,0,...,0,0,1,0,0,0,0,0,0,1

In [52]:
df4_3_ans1 = df4_3_ans.iloc[:, 1:]
df4_3_ans1.head(2)

,gender,age_group,marital,prod,purchase,job_0,job_1,job_2,job_3,job_4,...,job_14,job_15,job_16,job_17,job_18,job_19,job_20,city_A,city_B,city_C
0,0,0,0,35,334093,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
1,1,6,0,77,810472,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,1

In [53]:
from sklearn.preprocessing import MinMaxScaler

In [54]:
model_nor = MinMaxScaler()

In [56]:
df4_3_ans_nor = model_nor.fit_transform(df4_3_ans1)
df4_3_ans_nor

array([[0.        , 0.        , 0.        , ..., 1.        , 0.        ,
        0.        ],
       [1.        , 1.        , 0.        , ..., 0.        , 0.        ,
        1.        ],
       [1.        , 0.33333333, 0.        , ..., 1.        , 0.        ,
        0.        ],
       ...,
       [1.        , 0.5       , 0.        , ..., 0.        , 0.        ,
        1.        ],
       [1.        , 0.33333333, 0.        , ..., 1.        , 0.        ,
        0.        ],
       [1.        , 0.16666667, 1.        , ..., 0.        , 0.        ,
        1.        ]])

In [57]:
df4_3_ans_nor = pd.DataFrame(df4_3_ans_nor, columns=df4_3_ans1.columns)
df4_3_ans_nor.head(2)

,gender,age_group,marital,prod,purchase,job_0,job_1,job_2,job_3,job_4,...,job_14,job_15,job_16,job_17,job_18,job_19,job_20,city_A,city_B,city_C
0,0.0,0.0,0.0,0.028431,0.027398,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
1,1.0,1.0,0.0,0.069608,0.072810,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0

In [58]:
from sklearn.cluster import KMeans

In [60]:
model_kmeans= KMeans(n_clusters=7, random_state=123)

In [61]:
model_kmeans.fit(df4_3_ans_nor)

C:\Users\GODIMODE\AppData\Local\Programs\Python\Python39\lib\site-packages\sklearn\cluster\_kmeans.py:870: FutureWarning: The default value of `n_init` will change from 10 to 'auto' in 1.4. Set the value of `n_init` explicitly to suppress the warning
  warnings.warn(

KMeans(n_clusters=7, random_state=123)

In [66]:
model_kmeans.labels_

array([3, 1, 3, ..., 1, 3, 5])

In [63]:
from sklearn.metrics import silhouette_score

In [67]:
score = silhouette_score(df4_3_ans_nor, labels=model_kmeans.labels_)
score

0.17924689113287728

## Q5.

In [72]:
df5 = pd.read_csv("card_cust.csv")
df5.head(2)

,CUST_ID,BALANCE,BALANCE_FREQUENCY,PURCHASES,ONEOFF_PURCHASES,INSTALLMENTS_PURCHASES,CASH_ADVANCE,PURCHASES_FREQUENCY,ONEOFF_PURCHASES_FREQUENCY,PURCHASES_INSTALLMENTS_FREQUENCY,CASH_ADVANCE_FREQUENCY,CASH_ADVANCE_TRX,PURCHASES_TRX,CREDIT_LIMIT,PAYMENTS,MINIMUM_PAYMENTS,PRC_FULL_PAYMENT,TENURE
0,10001,40.900749,0.818182,95.4,0.0,95.4,0.000000,0.166667,0.0,0.083333,0.00,0.0,2.0,1000.0,201.802084,139.509787,0.000000,12.0
1,10002,3202.467416,0.909091,0.0,0.0,0.0,6442.945483,0.000000,0.0,0.000000,0.25,4.0,0.0,7000.0,4103.032597,1072.340217,0.222222,12.0

In [73]:
df5_base = df5.copy()

In [74]:
df5_base["CREDIT_LIMIT"] = df5_base["CREDIT_LIMIT"].fillna(df5_base["CREDIT_LIMIT"].mean())
df5_base["MINIMUM_PAYMENTS"] = df5_base["MINIMUM_PAYMENTS"].fillna(df5_base["MINIMUM_PAYMENTS"].mean())

In [75]:
df5_base["CREDIT_LIMIT"].isna().sum()

0

In [80]:
df5_base["TENURE"].unique()

array([12.,  8., 11.,  9., 10.,  7.,  6.])

In [81]:
df5_base["TENURE"].nunique()

7

In [82]:
df5_q1 = df5_base[["TENURE", "BALANCE", "CREDIT_LIMIT"]].copy()
df5_q1.head(2)

   TENURE      BALANCE  CREDIT_LIMIT
0    12.0    40.900749        1000.0
1    12.0  3202.467416        7000.0

In [83]:
df5_q1.groupby(["TENURE"])["BALANCE", "CREDIT_LIMIT"].corr()

C:\Users\GODIMODE\AppData\Local\Temp\ipykernel_10072\3932859537.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df5_q1.groupby(["TENURE"])["BALANCE", "CREDIT_LIMIT"].corr()

                      BALANCE  CREDIT_LIMIT
TENURE
6.0    BALANCE       1.000000      0.868056
       CREDIT_LIMIT  0.868056      1.000000
7.0    BALANCE       1.000000      0.948405
       CREDIT_LIMIT  0.948405      1.000000
8.0    BALANCE       1.000000      0.820696
       CREDIT_LIMIT  0.820696      1.000000
9.0    BALANCE       1.000000      0.085474
       CREDIT_LIMIT  0.085474      1.000000
10.0   BALANCE       1.000000      0.291482
       CREDIT_LIMIT  0.291482      1.000000
11.0   BALANCE       1.000000      0.380360
       CREDIT_LIMIT  0.380360      1.000000
12.0   BALANCE       1.000000      0.460833
       CREDIT_LIMIT  0.460833      1.000000

In [84]:
from sklearn.preprocessing import StandardScaler

In [85]:
df5_q2 = df5_base.copy()
df5_q2.head(2)

,CUST_ID,BALANCE,BALANCE_FREQUENCY,PURCHASES,ONEOFF_PURCHASES,INSTALLMENTS_PURCHASES,CASH_ADVANCE,PURCHASES_FREQUENCY,ONEOFF_PURCHASES_FREQUENCY,PURCHASES_INSTALLMENTS_FREQUENCY,CASH_ADVANCE_FREQUENCY,CASH_ADVANCE_TRX,PURCHASES_TRX,CREDIT_LIMIT,PAYMENTS,MINIMUM_PAYMENTS,PRC_FULL_PAYMENT,TENURE
0,10001,40.900749,0.818182,95.4,0.0,95.4,0.000000,0.166667,0.0,0.083333,0.00,0.0,2.0,1000.0,201.802084,139.509787,0.000000,12.0
1,10002,3202.467416,0.909091,0.0,0.0,0.0,6442.945483,0.000000,0.0,0.000000,0.25,4.0,0.0,7000.0,4103.032597,1072.340217,0.222222,12.0

In [86]:
z_model = StandardScaler()

In [97]:
len(df5_q2.columns)

18

In [98]:
df5_q2_nor = z_model.fit_transform(df5_q2.iloc[:, 1:])
df5_q2_nor

array([[-0.84876759, -0.41987944, -0.4419358 , ..., -0.44372465,
        -0.46554357,  0.28242902],
       [ 0.28279099,  0.01213096, -0.4690169 , ..., -0.08615941,
         0.33159169,  0.28242902],
       [ 0.0296341 ,  0.44414137, -0.24953794, ..., -0.25675456,
        -0.46554357,  0.28242902],
       ...,
       [-0.04555583,  0.44414137, -0.4690169 , ..., -0.1126367 ,
        -0.46554357,  0.28242902],
       [ 0.18482699,  0.44414137, -0.4233367 , ..., -0.07613978,
        -0.46554357,  0.28242902],
       [-0.34079285,  0.44414137, -0.20275918, ...,  0.00909944,
        -0.46554357,  0.28242902]])

In [99]:
df5_q2_nor = pd.DataFrame(df5_q2_nor, columns=df5_q2.columns[1:])
df5_q2_nor.head(2)

,BALANCE,BALANCE_FREQUENCY,PURCHASES,ONEOFF_PURCHASES,INSTALLMENTS_PURCHASES,CASH_ADVANCE,PURCHASES_FREQUENCY,ONEOFF_PURCHASES_FREQUENCY,PURCHASES_INSTALLMENTS_FREQUENCY,CASH_ADVANCE_FREQUENCY,CASH_ADVANCE_TRX,PURCHASES_TRX,CREDIT_LIMIT,PAYMENTS,MINIMUM_PAYMENTS,PRC_FULL_PAYMENT,TENURE
0,-0.848768,-0.419879,-0.441936,-0.374048,-0.395301,-0.482354,-0.872701,-0.804321,-0.719620,-0.684701,-0.457918,-0.564116,-1.161669,-0.557396,-0.443725,-0.465544,0.282429
1,0.282791,0.012131,-0.469017,-0.374048,-0.470304,1.878468,-1.282558,-0.804321,-0.924403,0.513493,0.065417,-0.628057,0.150025,0.360574,-0.086159,0.331592,0.282429

In [103]:
df5_q2_ans = pd.concat([df5_q2["CUST_ID"], df5_q2_nor], axis=1)
df5_q2_ans.head(2)

,CUST_ID,BALANCE,BALANCE_FREQUENCY,PURCHASES,ONEOFF_PURCHASES,INSTALLMENTS_PURCHASES,CASH_ADVANCE,PURCHASES_FREQUENCY,ONEOFF_PURCHASES_FREQUENCY,PURCHASES_INSTALLMENTS_FREQUENCY,CASH_ADVANCE_FREQUENCY,CASH_ADVANCE_TRX,PURCHASES_TRX,CREDIT_LIMIT,PAYMENTS,MINIMUM_PAYMENTS,PRC_FULL_PAYMENT,TENURE
0,10001,-0.848768,-0.419879,-0.441936,-0.374048,-0.395301,-0.482354,-0.872701,-0.804321,-0.719620,-0.684701,-0.457918,-0.564116,-1.161669,-0.557396,-0.443725,-0.465544,0.282429
1,10002,0.282791,0.012131,-0.469017,-0.374048,-0.470304,1.878468,-1.282558,-0.804321,-0.924403,0.513493,0.065417,-0.628057,0.150025,0.360574,-0.086159,0.331592,0.282429

In [107]:
from sklearn.cluster import KMeans
from sklearn.metrics import silhouette_score

In [104]:
lista = [2,3,4,5]

In [118]:
ans = []
for i in lista:
    model_k = KMeans(n_clusters=i, random_state=1234)
    model_k.fit(df5_q2_nor)
    score = silhouette_score(df5_q2_nor, labels=model_k.labels_)
    ans.append(score)
ans

C:\Users\GODIMODE\AppData\Local\Programs\Python\Python39\lib\site-packages\sklearn\cluster\_kmeans.py:870: FutureWarning: The default value of `n_init` will change from 10 to 'auto' in 1.4. Set the value of `n_init` explicitly to suppress the warning
  warnings.warn(
C:\Users\GODIMODE\AppData\Local\Programs\Python\Python39\lib\site-packages\sklearn\cluster\_kmeans.py:870: FutureWarning: The default value of `n_init` will change from 10 to 'auto' in 1.4. Set the value of `n_init` explicitly to suppress the warning
  warnings.warn(
C:\Users\GODIMODE\AppData\Local\Programs\Python\Python39\lib\site-packages\sklearn\cluster\_kmeans.py:870: FutureWarning: The default value of `n_init` will change from 10 to 'auto' in 1.4. Set the value of `n_init` explicitly to suppress the warning
  warnings.warn(
C:\Users\GODIMODE\AppData\Local\Programs\Python\Python39\lib\site-packages\sklearn\cluster\_kmeans.py:870: FutureWarning: The default value of `n_init` will change from 10 to 'auto' in 1.4. Set the value of `n_init` explicitly to suppress the warning
  warnings.warn(

[0.3075281530456079,
 0.19636128772937608,
 0.207150984946399,
 0.19274056144483248]

In [119]:
model_k = KMeans(n_clusters=2, random_state=1234)
model_k.fit(df5_q2_nor)

C:\Users\GODIMODE\AppData\Local\Programs\Python\Python39\lib\site-packages\sklearn\cluster\_kmeans.py:870: FutureWarning: The default value of `n_init` will change from 10 to 'auto' in 1.4. Set the value of `n_init` explicitly to suppress the warning
  warnings.warn(

KMeans(n_clusters=2, random_state=1234)

In [122]:
df5_q2["cluster"] = model_k.labels_

In [123]:
df5_q2.groupby(["cluster"])["ONEOFF_PURCHASES"].mean()

cluster
0     340.230998
1    3946.187525
Name: ONEOFF_PURCHASES, dtype: float64

In [132]:
df5_q3 = df5_base.copy()
df5_q3.head(2)

,CUST_ID,BALANCE,BALANCE_FREQUENCY,PURCHASES,ONEOFF_PURCHASES,INSTALLMENTS_PURCHASES,CASH_ADVANCE,PURCHASES_FREQUENCY,ONEOFF_PURCHASES_FREQUENCY,PURCHASES_INSTALLMENTS_FREQUENCY,CASH_ADVANCE_FREQUENCY,CASH_ADVANCE_TRX,PURCHASES_TRX,CREDIT_LIMIT,PAYMENTS,MINIMUM_PAYMENTS,PRC_FULL_PAYMENT,TENURE
0,10001,40.900749,0.818182,95.4,0.0,95.4,0.000000,0.166667,0.0,0.083333,0.00,0.0,2.0,1000.0,201.802084,139.509787,0.000000,12.0
1,10002,3202.467416,0.909091,0.0,0.0,0.0,6442.945483,0.000000,0.0,0.000000,0.25,4.0,0.0,7000.0,4103.032597,1072.340217,0.222222,12.0

In [133]:
df5_q3_train = df5_q3.loc[df5_q3["CUST_ID"] % 4 != 0, :]
df5_q3_test = df5_q3.loc[df5_q3["CUST_ID"] % 4 == 0, :]
len(df5_q3_train), len(df5_q3_test)

(752, 248)

In [129]:
from sklearn.tree import DecisionTreeRegressor

In [149]:
df5_q3_train = df5_q3_train.drop(columns="CUST_ID")
df5_q3_test = df5_q3_test.drop(columns="CUST_ID")

In [150]:
model_tree = DecisionTreeRegressor(random_state=1234)

In [151]:
model_tree.fit(X = df5_q3_train.drop(columns="ONEOFF_PURCHASES"), y = df5_q3_train["ONEOFF_PURCHASES"])

DecisionTreeRegressor(random_state=1234)

In [152]:
pred = model_tree.predict(df5_q3_test.drop(columns="ONEOFF_PURCHASES"))
pred[:4]

array([1500.,    0., 1490.,    0.])

In [153]:
from sklearn.metrics import mean_squared_error

In [154]:
ans = mean_squared_error(y_true=df5_q3_test["ONEOFF_PURCHASES"], y_pred=pred) ** (1/2)
ans

1039.193967231063

## Q6.

In [3]:
import pandas as pd

In [47]:
df6 = pd.read_csv("edu_enrollees.csv")
df6.head(2)

,enrollee_id,city,city_development_index,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target,Xgrp
0,8949.0,city_103,0.920,Male,Has relevant experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36.0,1.0,train
1,29725.0,city_40,0.776,Male,No relevant experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47.0,0.0,train

In [48]:
df6_base = df6.drop(columns=["city", "company_size", "company_type"])
df6_base.head(2)

,enrollee_id,city_development_index,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,last_new_job,training_hours,target,Xgrp
0,8949.0,0.920,Male,Has relevant experience,no_enrollment,Graduate,STEM,>20,1,36.0,1.0,train
1,29725.0,0.776,Male,No relevant experience,no_enrollment,Graduate,STEM,15,>4,47.0,0.0,train

In [49]:
df6_base.dtypes

enrollee_id               float64
city_development_index    float64
gender                     object
relevant_experience        object
enrolled_university        object
education_level            object
major_discipline           object
experience                 object
last_new_job               object
training_hours            float64
target                    float64
Xgrp                       object
dtype: object

In [50]:
df6_base.isna().sum()

enrollee_id                  0
city_development_index       0
gender                    4508
relevant_experience          0
enrolled_university        386
education_level            460
major_discipline          2813
experience                  65
last_new_job               423
training_hours               0
target                       0
Xgrp                         0
dtype: int64

In [51]:
df6_base = df6_base.dropna()
df6_base.shape

(12477, 12)

In [52]:
df6_base.head(2)

,enrollee_id,city_development_index,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,last_new_job,training_hours,target,Xgrp
0,8949.0,0.920,Male,Has relevant experience,no_enrollment,Graduate,STEM,>20,1,36.0,1.0,train
1,29725.0,0.776,Male,No relevant experience,no_enrollment,Graduate,STEM,15,>4,47.0,0.0,train

In [53]:
df6_base["experience"].unique()

array(['>20', '15', '13', '7', '5', '16', '4', '11', '<1', '18', '19',
       '12', '10', '9', '2', '6', '14', '3', '8', '20', '17', '1'],
      dtype=object)

In [54]:
df6_base = df6_base.loc[(df6_base["experience"] != ">20") & (df6_base["experience"] != "<1"), :]
df6_base.shape

(9653, 12)

In [55]:
df6_base["experience"] = df6_base["experience"].astype("int")
df6_base.dtypes

enrollee_id               float64
city_development_index    float64
gender                     object
relevant_experience        object
enrolled_university        object
education_level            object
major_discipline           object
experience                  int32
last_new_job               object
training_hours            float64
target                    float64
Xgrp                       object
dtype: object

In [56]:
df6_base["last_new_job"].unique()

array(['>4', '1', '2', '3', 'never', '4'], dtype=object)

In [57]:
df6_base = df6_base.loc[(df6_base["last_new_job"] != ">4") & (df6_base["last_new_job"] != "never"), :]
df6_base.shape

(7522, 12)

In [58]:
df6_base["last_new_job"] = df6_base["last_new_job"].astype("int")

In [59]:
df6_base.head(2)

,enrollee_id,city_development_index,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,last_new_job,training_hours,target,Xgrp
8,27107.0,0.92,Male,Has relevant experience,no_enrollment,Graduate,STEM,7,1,46.0,1.0,train
11,23853.0,0.92,Male,Has relevant experience,no_enrollment,Graduate,STEM,5,1,108.0,0.0,train

In [60]:
df6_q1 = df6_base.copy()

In [61]:
df6_q1["relevant_experience"].unique()

array(['Has relevant experience', 'No relevant experience'], dtype=object)

In [62]:
df6_q1 = df6_q1[["target", "relevant_experience"]].copy()

In [87]:
df6_q1.groupby("relevant_experience")["target"].value_counts(normalize=True)

relevant_experience      target
Has relevant experience  0.0       0.784089
                         1.0       0.215911
No relevant experience   0.0       0.617127
                         1.0       0.382873
Name: target, dtype: float64

In [86]:
df6_q1.groupby("relevant_experience")["target"].count()

relevant_experience
Has relevant experience    6109
No relevant experience     1413
Name: target, dtype: int64

In [64]:
round((541 / (872 + 541)) / (1319 / (4790 + 1319)), 2)

1.77

In [65]:
df6_base.head(2)

,enrollee_id,city_development_index,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,last_new_job,training_hours,target,Xgrp
8,27107.0,0.92,Male,Has relevant experience,no_enrollment,Graduate,STEM,7,1,46.0,1.0,train
11,23853.0,0.92,Male,Has relevant experience,no_enrollment,Graduate,STEM,5,1,108.0,0.0,train

In [104]:
df6_q2 = df6_base.copy()

In [105]:
lista = ["gender", "relevant_experience", "enrolled_university", "education_level", "major_discipline"]
for col in lista:
    aa = df6_q2[col].unique()
    aa.sort()
    bb = col + "_" + aa[aa.size - 1]
    print(bb)
    df6_q2 = pd.get_dummies(df6_q2, columns=[col])
    df6_q2 = df6_q2.drop(columns=bb)
df6_q2.head(2)

gender_Other
relevant_experience_No relevant experience
enrolled_university_no_enrollment
education_level_Phd
major_discipline_STEM

,enrollee_id,city_development_index,experience,last_new_job,training_hours,target,Xgrp,gender_Female,gender_Male,relevant_experience_Has relevant experience,enrolled_university_Full time course,enrolled_university_Part time course,education_level_Graduate,education_level_Masters,major_discipline_Arts,major_discipline_Business Degree,major_discipline_Humanities,major_discipline_No Major,major_discipline_Other
8,27107.0,0.92,7,1,46.0,1.0,train,0,1,1,0,0,1,0,0,0,0,0,0
11,23853.0,0.92,5,1,108.0,0.0,train,0,1,1,0,0,1,0,0,0,0,0,0

In [68]:
df6_q2.columns

Index(['enrollee_id', 'city_development_index', 'experience', 'last_new_job',
       'training_hours', 'target', 'Xgrp', 'gender_Female', 'gender_Male',
       'relevant_experience_Has relevant experience',
       'enrolled_university_Full time course',
       'enrolled_university_no_enrollment', 'education_level_Graduate',
       'education_level_Masters', 'major_discipline_Arts',
       'major_discipline_Business Degree', 'major_discipline_Humanities',
       'major_discipline_Other', 'major_discipline_STEM'],
      dtype='object')

In [106]:
df6_job2 = df6_q2.drop(columns="enrollee_id")
df6_job2.head(2)

,city_development_index,experience,last_new_job,training_hours,target,Xgrp,gender_Female,gender_Male,relevant_experience_Has relevant experience,enrolled_university_Full time course,enrolled_university_Part time course,education_level_Graduate,education_level_Masters,major_discipline_Arts,major_discipline_Business Degree,major_discipline_Humanities,major_discipline_No Major,major_discipline_Other
8,0.92,7,1,46.0,1.0,train,0,1,1,0,0,1,0,0,0,0,0,0
11,0.92,5,1,108.0,0.0,train,0,1,1,0,0,1,0,0,0,0,0,0

In [107]:
from sklearn.linear_model import LogisticRegression

In [108]:
model_logi = LogisticRegression(C=100000, max_iter=1000, solver="liblinear", random_state=123)

In [109]:
model_logi.fit(X=df6_job2.drop(columns=["target", "Xgrp"]), y = df6_job2["target"])

LogisticRegression(C=100000, max_iter=1000, random_state=123,
                   solver='liblinear')

In [110]:
model_logi.coef_

array([[-6.13171281e+00, -2.81668751e-02,  9.57793226e-02,
        -9.23884851e-04, -1.51973548e-01, -1.12752415e-01,
        -7.65608959e-01,  5.15885618e-01, -2.76427313e-01,
         3.52639495e-01,  4.79687374e-02,  3.10525158e-01,
         1.23042600e-01,  2.65866999e-01,  4.22332790e-01,
        -4.34707822e-01]])

In [112]:
import numpy as np

In [114]:
np.exp(model_logi.coef_).max()

1.6751213625232795

In [111]:
round(model_logi.coef_.max(), 2)

0.52

In [77]:
df6_job2.head(2)

,city_development_index,experience,last_new_job,training_hours,target,Xgrp,gender_Female,gender_Male,relevant_experience_Has relevant experience,enrolled_university_Full time course,enrolled_university_no_enrollment,education_level_Graduate,education_level_Masters,major_discipline_Arts,major_discipline_Business Degree,major_discipline_Humanities,major_discipline_Other,major_discipline_STEM
8,0.92,7,1,46.0,1.0,train,0,1,1,0,1,1,0,0,0,0,0,1
11,0.92,5,1,108.0,0.0,train,0,1,1,0,1,1,0,0,0,0,0,1

In [78]:
df6_train = df6_job2.loc[df6_job2["Xgrp"] == "train", :]
df6_test = df6_job2.loc[df6_job2["Xgrp"] == "test", :]

In [79]:
from sklearn.neighbors import KNeighborsClassifier

In [80]:
model_knc = KNeighborsClassifier()

In [81]:
model_knc.fit(X = df6_train.drop(columns=["target", "Xgrp"]), y = df6_train["target"])

KNeighborsClassifier()

In [82]:
pred = model_knc.predict(df6_test.drop(columns=["target", "Xgrp"]))
pred[:4]

array([0., 0., 0., 1.])

In [83]:
from sklearn.metrics import accuracy_score

In [84]:
score = accuracy_score(y_true= df6_test["target"], y_pred = pred)

In [85]:
round(score, 2)

0.71